package com.android.feature.map.repositories

import com.yandex.mapkit.geometry.Point
import javax.inject.Inject
import javax.inject.Singleton

/**
 * This class contains points for all Polytech's buildings. It uses the Russian names like a keys, because server has only
 * the Russian variant.
 *
 * @constructor Create empty constructor for map points
 */
@Singleton
internal class MapPoints @Inject constructor() {
    private val points by lazy {
        mapOf(
            "ВИТ" to Point(60.009296, 30.387688),
            "16-й учебный корпус" to Point(60.007551, 30.390788),
            "ЦНИИ конструкционных материалов «Прометей»" to Point(59.948505, 30.381346),
            "НОЦ УчК" to Point(60.003084, 30.373243),
            "Химический корпус" to Point(60.006894, 30.376630),
            "Лабораторный корпус" to Point(60.007573, 30.379954),
            "6-й учебный корпус" to Point(60.000074, 30.367602),
            "9-й учебный корпус" to Point(60.000906, 30.366614),
            "48 учебный корпус" to Point(59.995093, 30.353391),
            "Гидротехнический корпус-1 Северная пристройка" to Point(60.006588, 30.383448),
            "Главное здание" to Point(60.007461, 30.373100),
            "4-й учебный корпус" to Point(60.007294, 30.376630),
            "ТВН" to Point(60.009296, 30.387688),
            "Институт ядерной энергетики (филиал ФГАОУ ВО СПбПУ) г. Сосновый Бор" to Point(59.905010, 29.099819),
            "Гидробашня" to Point(60.005567, 30.374178),
            "Механический корпус" to Point(60.008392, 30.377843),
            "ФТИ им. А.Ф. Иоффе" to Point(60.006849, 30.368707),
            "2-й учебный корпус" to Point(60.0085, 30.37480),
            "Научно-исследовательский корпус" to Point(60.006269, 30.379298),
            "Гидротехнический корпус-1" to Point(60.006588, 30.383448),
            "Военная кафедра" to Point(60.009053, 30.377870),
            "3-й учебный корпус" to Point(60.007254, 30.381742),
            "11-й учебный корпус" to Point(60.009053, 30.377870),
            "Институт Проблем Mашиноведения  РАН" to Point(59.935624, 30.269039),
            "СОШ № 7" to Point(59.915630, 29.087961),
            "ЦНИИ РТК" to Point(60.021496, 30.368626),
            "50 учебный корпус" to Point(59.994405, 30.358727),
            "1-й учебный корпус" to Point(60.00875, 30.373),
            "Государственный Эрмитаж" to Point(59.989436, 30.255169),
            "15-й учебный корпус" to Point(60.007551, 30.390788),
            "Корпус \"Башня\"" to Point(60.015377, 30.301594),
            "Спорткомплекс" to Point(60.002733, 30.369084),
            "ТВН-2" to Point(60.009296, 30.387688),
            "5-й учебный корпус" to Point(59.999615, 30.374744),
            "ПСПБГМУ им. Павлова" to Point(59.964480, 30.321429),
            "Санкт-Петербургский институт машиностроения" to Point(59.966043, 30.396249),
            "Гидротехнический корпус-2" to Point(60.006588, 30.383448),
            "УПК 1-й учебный корпус" to Point(60.003561, 30.329334),
            "Институт ядерной энергетики" to Point(59.905010, 29.099819),
            "НОЦ СЛК" to Point(60.003084, 30.373243),
            "17-й учебный корпус" to Point(60.009296, 30.387688),
            "ФГУП \"ВНИИМ им. Д.И.Менделеева\"" to Point(59.917526, 30.317450),
            "Центр Алмазова" to Point(59.934529, 30.353885),
            "Университетский политехнический колледж" to Point(60.003565, 30.329334),
            "НИИ ПТ" to Point(60.009125, 30.361026)
        )
    }

    /**
     * Get point.
     *
     * @param keyWord Key word
     * @return [Point] or null
     */
    internal fun getPoint(keyWord: String): Point? = points[keyWord]
}